In [1]:
import pandas as pd 
import warnings 
warnings.filterwarnings("ignore")

In [2]:
import numpy as np

In [3]:
data = pd.read_csv("homeprices.csv")

In [4]:
data

               town  area   price
0   monroe township  2600  550000
1   monroe township  3000  565000
2   monroe township  3200  610000
3   monroe township  3600  680000
4   monroe township  4000  725000
5      west windsor  2600  585000
6      west windsor  2800  615000
7      west windsor  3300  650000
8      west windsor  3600  710000
9       robinsville  2600  575000
10      robinsville  2900  600000
11      robinsville  3100  620000
12      robinsville  3600  695000

price = m1*x1 + m2*x2 + b

In [5]:
data.replace([ "monroe township" , "west windsor" , "robinsville" ] , [ "faysal" , "el helmya" , "el haram" ] , inplace= True)

In [6]:
data

         town  area   price
0      faysal  2600  550000
1      faysal  3000  565000
2      faysal  3200  610000
3      faysal  3600  680000
4      faysal  4000  725000
5   el helmya  2600  585000
6   el helmya  2800  615000
7   el helmya  3300  650000
8   el helmya  3600  710000
9    el haram  2600  575000
10   el haram  2900  600000
11   el haram  3100  620000
12   el haram  3600  695000

In [7]:
data.groupby("town").mean()[["price"]]

              price
town
el haram   622500.0
el helmya  640000.0
faysal     626000.0

In [8]:
data.groupby("town").mean()

             area     price
town
el haram   3050.0  622500.0
el helmya  3075.0  640000.0
faysal     3280.0  626000.0

In [9]:
data.town.value_counts()

faysal       5
el helmya    4
el haram     4
Name: town, dtype: int64

In [10]:
data["p/m"]  = data.price / data.area

In [11]:
data

         town  area   price         p/m
0      faysal  2600  550000  211.538462
1      faysal  3000  565000  188.333333
2      faysal  3200  610000  190.625000
3      faysal  3600  680000  188.888889
4      faysal  4000  725000  181.250000
5   el helmya  2600  585000  225.000000
6   el helmya  2800  615000  219.642857
7   el helmya  3300  650000  196.969697
8   el helmya  3600  710000  197.222222
9    el haram  2600  575000  221.153846
10   el haram  2900  600000  206.896552
11   el haram  3100  620000  200.000000
12   el haram  3600  695000  193.055556

In [12]:
data.groupby("town").mean()[["p/m"]]

                  p/m
town
el haram   205.276488
el helmya  209.708694
faysal     192.127137

In [34]:
data

         town  area   price         p/m
0      faysal  2600  550000  211.538462
1      faysal  3000  565000  188.333333
2      faysal  3200  610000  190.625000
3      faysal  3600  680000  188.888889
4      faysal  4000  725000  181.250000
5   el helmya  2600  585000  225.000000
6   el helmya  2800  615000  219.642857
7   el helmya  3300  650000  196.969697
8   el helmya  3600  710000  197.222222
9    el haram  2600  575000  221.153846
10   el haram  2900  600000  206.896552
11   el haram  3100  620000  200.000000
12   el haram  3600  695000  193.055556

In [13]:
towns = pd.get_dummies(data.town)
towns

    el haram  el helmya  faysal
0          0          0       1
1          0          0       1
2          0          0       1
3          0          0       1
4          0          0       1
5          0          1       0
6          0          1       0
7          0          1       0
8          0          1       0
9          1          0       0
10         1          0       0
11         1          0       0
12         1          0       0

price = m1 * el haram + m2 * helmya + m3 * faysal + m4 * area + b

**Task : types of encoding & when to use each**

In [14]:
final = pd.concat( [data, towns] , axis= 1  )

In [15]:
final

         town  area   price         p/m  el haram  el helmya  faysal
0      faysal  2600  550000  211.538462         0          0       1
1      faysal  3000  565000  188.333333         0          0       1
2      faysal  3200  610000  190.625000         0          0       1
3      faysal  3600  680000  188.888889         0          0       1
4      faysal  4000  725000  181.250000         0          0       1
5   el helmya  2600  585000  225.000000         0          1       0
6   el helmya  2800  615000  219.642857         0          1       0
7   el helmya  3300  650000  196.969697         0          1       0
8   el helmya  3600  710000  197.222222         0          1       0
9    el haram  2600  575000  221.153846         1          0       0
10   el haram  2900  600000  206.896552         1          0       0
11   el haram  3100  620000  200.000000         1          0       0
12   el haram  3600  695000  193.055556         1          0       0

In [16]:
x = final.drop (["town" , "p/m", "price"] , axis= 1 )

In [17]:
x

    area  el haram  el helmya  faysal
0   2600         0          0       1
1   3000         0          0       1
2   3200         0          0       1
3   3600         0          0       1
4   4000         0          0       1
5   2600         0          1       0
6   2800         0          1       0
7   3300         0          1       0
8   3600         0          1       0
9   2600         1          0       0
10  2900         1          0       0
11  3100         1          0       0
12  3600         1          0       0

In [18]:
y = final.price

In [19]:
from sklearn.linear_model import LinearRegression

In [20]:
model = LinearRegression()

In [46]:
model.fit(x,y)

LinearRegression()

In [47]:
model.score(x,y)

0.9573929037221874

In [50]:
model.predict ( [[2600 ,0 ,0 ,1]])

array([539709.73984091])